.emacs.d/init.el
;; -*- lexical-binding: t; -*-
(setq gc-cons-threshold (* 50 1000 1000))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(setq straight-use-package-by-default t) ;; 自动安装所有插件
(straight-use-package 'use-package) ;; 安装 use-package

(defun my/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "emacs-config.org" user-emacs-directory))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook
          (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config)))

(use-package no-littering
  :custom
  (auto-save-file-name-transforms `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))) ;; 设置自动保存文件路径

(use-package recentf
  :after no-littering
  :custom
  (recentf-exclude '(no-littering-var-directory
                     no-littering-etc-directory)) ;; 屏蔽临时文件
  (recentf-max-menu-items 25)
  (recentf-max-saved-items 25)
  :bind ("C-x C-r" . 'recentf-open-files)
  :config
  (recentf-mode 1))

(setq my/is-windows (eq system-type 'windows-nt))
(setq my/is-tablet (eq system-type 'gnu/linux))

(setq native-comp-deferred-compilation-deny-list '(".*pdf.*")) ;; 禁用 =pdf-tools= 有关文件的本地化编译

(prefer-coding-system 'utf-8) ;; 默认编码
(setq-default buffer-file-coding-system 'utf-8-unix) ;; 默认 EOL 设置

(if (eq system-type 'windows-nt)
    (progn
      (set-face-attribute 'default nil :font "Fira Mono" :height 160) ;; 默认字体及字号. Fira Mono 需要另行安装
      (set-fontset-font "fontset-default" 'han "Kaiti") ;; 中文默认字体
      (set-fontset-font "fontset-default" 'mathematical "Cambria Math") ;; 数学符号默认字体
      ))
(setq inhibit-compacting-font-caches t) ;; 汉字显示问题

(set-face-attribute 'fixed-pitch nil :font "JetBrains Mono"  :height 150) ;; 固定间距字体. JetBrains Mono 需要另行安装
(set-face-attribute 'variable-pitch nil :font "Segoe Print" :height 160 :weight 'regular) ;; 可变间距字体

(defun my/pyim-probe-latex-mode ()
 "latex-mode 中的数学环境自动切换到英文输入."
 (and (eq major-mode 'latex-mode)
      (if (fboundp 'texmathp) (texmathp) nil)))

(use-package popup :defer t) ;; 选词框
(use-package pyim-wbdict :defer 2) ;; 五笔输入法
(use-package pyim 
  :defer 2
  :after pyim-wbdict
  :bind
  ("M-j" . 'pyim-convert-string-at-point)
  :config
  (setq default-input-method "pyim")
  (setq pyim-default-scheme 'wubi)
  (pyim-wbdict-v86-enable)
  (require 'popup)
  (setq pyim-page-tooltip 'popup)
  (setq-default pyim-punctuation-translate-p '(no));; 总是输入半角标点。
  (setq-default pyim-english-input-switch-functions
              '(pyim-probe-auto-english
                pyim-probe-isearch-mode
                pyim-probe-program-mode
                pyim-probe-org-structure-template
                pyim-probe-org-latex-mode
                my/pyim-probe-latex-mode))
  (setq-default pyim-punctuation-half-width-functions
              '(pyim-probe-punctuation-line-beginning
                pyim-probe-punctuation-after-punctuation)))

(defun my/load-doom-theme (theme)
  "Disable active themes and load a Doom theme."
  (interactive (list (intern (completing-read "Theme: "
                                              (->> (custom-available-themes)
                                                   (-map #'symbol-name)
                                                   (--select (string-prefix-p "doom-" it)))))))
  (ap/switch-theme theme)
  (set-face-foreground 'org-indent (face-background 'default)))

(defun my/switch-theme (theme)
  "Disable active themes and load THEME."
  (interactive (list (intern (completing-read "Theme: "
                                              (->> (custom-available-themes)
                                                   (-map #'symbol-name))))))
  (mapc #'disable-theme custom-enabled-themes)
  (load-theme theme 'no-confirm))

(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-moonlight t)
  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  ;;  (doom-themes-neotree-config)
  ;; or for treemacs users
  ;; (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  ;;(doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

;; (use-package modus-themes)
;; (setq modus-themes-common-palette-overrides
;;       `((bg-mode-line-active bg-red-subtle) 
;;         (fg-mode-line-active red-warmer)
;;         (border-mode-line-active unspecified) 
;;         (border-mode-line-inactive unspecified)
;;         (bg-region bg-lavender) 
;;         (fg-region unspecified)
;;         (fg-completion-match-0 fg-main)
;;         (fg-completion-match-1 fg-main)
;;         (fg-completion-match-2 fg-main)
;;         (fg-completion-match-3 fg-main)
;;         (bg-completion-match-0 bg-blue-intense)
;;         (bg-completion-match-1 bg-yellow-intense) 
;;         (bg-completion-match-2 bg-cyan-intense)
;;         (bg-completion-match-3 bg-red-intense)
;;         (comment yellow-cooler)
;;         (string green-cooler)
;;         (bg-paren-match bg-magenta-intense)
;;         ,@modus-themes-preset-overrides-intense))

;; (setq modus-themes-bold-construct t
;;       modus-themes-italic-construct t
;;       modus-themes-org-blocks 'tinted-background
;;       modus-themes-scale-headings t
;;       modus-themes-headings
;;       '((1 . (rainbow overline background 1.3))
;;         (2 . (rainbow background 1.2))
;;         (3 . (rainbow bold 1.15))
;;         (t . (semilight 1.1))))

;(load-theme 'modus-vivendi-tinted t)

(use-package all-the-icons
  :if (display-graphic-p)) ;; 需要另行安装字体
(use-package minions
  :hook doom-modeline-mode)
(use-package doom-modeline
  :hook (after-init . doom-modeline-mode)
  :custom
  (doom-modeline-unicode-fallback t)
  :config
  (custom-set-faces '(mode-line ((t (:height 0.85))))
                    '(mode-line-inactive ((t (:height 0.85))))))

(unless my/is-tablet
  (tool-bar-mode -1) ;; 禁用工具栏
  (scroll-bar-mode -1)) ;; 禁用滚动条
(menu-bar-mode -1) ;; 禁用菜单栏
