.emacs.d/init.el

(column-number-mode)
(visual-line-mode 1)
(global-display-line-numbers-mode t)
;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                eshell-mode-hook
                pdf-view-mode-hook
                eww-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(defun my/minibuffer-backward-kill (arg)
  "When minibuffer is completing a file name delete up to parent
folder, otherwise delete a word"
  (interactive "p")
  (if minibuffer-completing-file-name
      ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
      (if (string-match-p "/." (minibuffer-contents))
          (zap-up-to-char (- arg) ?/)
        (delete-minibuffer-contents))
    (delete-word (- arg))))

(use-package vertico
  :defer 1
  :custom
  (verticle-cycle t)
  :config
  (vertico-mode)
  :bind (:map minibuffer-local-map
              ("M-h" .  my/minibuffer-backward-kill)))

(use-package marginalia
  ;; Either bind `marginalia-cycle' globally or only in the minibuffer
  :bind (("M-A" . marginalia-cycle)
         :map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  :defer 1
  :config
  (marginalia-mode))

(use-package orderless
  :defer 1
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))

(use-package keycast
:after doom-modeline
:config
(setq keycast-mode-line-insert-after '(:eval (doom-modeline-format--main)))
(add-to-list 'global-mode-string '("" keycast-mode-line))
:hook
(doom-modeline-mode . keycast-mode-line-mode))

(use-package which-key
  :defer 2
  :diminish which-key-mode
  :custom (which-key-idle-delay 1)
  :config (which-key-mode))

(use-package helpful
  :defer 3
  :bind
  (("C-h f" . #'helpful-callable)
   ("C-h v" . #'helpful-variable)
   ("C-h k" . #'helpful-key)
   ("C-h x" . #'helpful-command)
   ("C-c C-d" . #'helpful-at-point)
   ("C-h F" . #'helpful-function)))

(use-package hydra
  :defer 5
  :init
  (require 'hydra))

(use-package evil :defer t)

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(defun match-paren (arg)
  "Go to the matching paren if on a paren; otherwise insert %."
  (interactive "p")
  (cond ((looking-at "\\s\(") (forward-list 1) (backward-char 1))
	((looking-at "\\s\)") (forward-char 1) (backward-list 1))
	(t (self-insert-command (or arg 1)))))
(global-set-key "%" 'match-paren)

(setq prettify-symbols-unprettify-at-point t) ;; 光标附近自动展开

(setq display-buffer-base-action
      '((display-buffer-reuse-window
         display-buffer-reuse-mode-window
         display-buffer-same-window
         display-buffer-in-previous-window)
        . ((mode . (org-mode helpful-mode help-mode)))))

(use-package popper
  :defer 3
  :bind (("C-M-'" . popper-toggle-latest)
         ("M-'" .  popper-cycle)
         ("C-M-;" . popper-toggle-type))
  :custom
  (popper-reference-buffers '("^\\*eshell\\*"
                              "^vterm"
                              help-mode
                              helpful-mode
                              compilation-mode
                              "\\*Messages\\*"
                              "Output\\*$"))
  :config
  (popper-mode +1)
  (popper-echo-mode +1))

(use-package ace-window
  :defer 2
  :bind ("M-o" . ace-window)
  :custom
  (aw-scope 'global)
  (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :config
  (ace-window-display-mode 1))

(use-package savehist
  :defer 2
  :config (savehist-mode))

(use-package super-save
  :defer 2
  :custom
  (super-save-auto-save-when-idle t)
  :config
  (super-save-mode +1))

(use-package saveplace
  :defer 2
  :config
  (save-place-mode 1))

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)

(if (eq system-type 'windows-nt)
  (setq temporary-file-directory "~/AppData/Local/Temp/"))

(setq safe-local-variable-values
      '((code . utf-8)
        (eval setq-local org-roam-db-location (file-truename "./org-roam.db")) ;; 允许多个 org-roam 目录
        (eval setq-local org-roam-directory (file-truename "./"))))
