.emacs.d/emacs-config.org
**** 补全命令模板
#+begin_src elisp :tangle ./cdlatex-config.el
  (setq cdlatex-command-alist
        '(("eq" "insert pairs of \\[ \\]" "\\[ ? \\]" cdlatex-position-cursor nil t t)
          ("exe" "Insert exercise" "\\begin{exercise}
         ?
         \\end{exercise}" cdlatex-position-cursor nil t nil)
          ("ons" "" "\\onslide<?>{ }" cdlatex-position-cursor nil t t)
          ("prop" "insert proposition" "" cdlatex-environment ("proposition") t nil)
          ("aali" "insert equation" "\\left\\{\\begin{aligned}
                   ?
                   \\end{aligned}\\right." cdlatex-position-cursor nil nil t)
          ("te" "insert text" "\\text{?}" cdlatex-position-cursor nil nil t)
          ("st" "stackrel" "\\stackrel{?}{}" cdlatex-position-cursor nil nil t)
          ("fra" "insert frame (for beamer)" "" cdlatex-environment ("frame") t nil)
          ("lr<" "insert bra-ket" "\\langle ? \\rangle" cdlatex-position-cursor nil nil t)
          ("spl" "insert split" "" cdlatex-environment ("split") nil t)
          ("equ*" "insert unlabel equation" "" cdlatex-environment ("equation*") t nil)
          ("ipite" "insert in paragraph itemize" "" cdlatex-environment ("inparaitem") t nil)
          ("ipenu" "insert in paragraph enumerate" "" cdlatex-environment ("inparaenum") t nil)
          ("des" "insert description" "" cdlatex-environment ("description") t nil)
          ("lem" "insert lemma env" "" cdlatex-environment ("lemma") t nil)
          ("thm" "insert theorem env" "" cdlatex-environment ("theorem") t nil)
          ("pro" "insert proof env" "" cdlatex-environment ("proof") t nil)
          ("def" "insert definition env" "" cdlatex-environment ("definition") t nil)
          ("liml" "insert \\lim\\limits_{}" "\\lim\\limits_{?}" cdlatex-position-cursor nil nil t)
          ("prodl" "insert \\prod\\limits_{}^{}" " \\prod\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
          ("cupl" "insert \\bigcup\\limits_{}^{}" "\\bigcup\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
          ("capl" "insert \\bigcap\\limits_{}^{}" "\\bigcap\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
          ("big(" "insert big ()" "\\big( ? \\big" cdlatex-position-cursor nil nil t)
          ("Big(" "insert Big ()" "\\Big( ? \\Big" cdlatex-position-cursor nil nil t)
          ("bigg(" "insert bigg()" "\\bigg( ? \\bigg" cdlatex-position-cursor nil nil t)
          ("big|" "insert big|" "\\big| ? \\big|" cdlatex-position-cursor nil nil t)
          ("Big|" "insert Big|" "\\Big| ? \\Big|" cdlatex-position-cursor nil nil t)
          ("bigg|" "insert bigg|" "\\bigg| ? \\bigg|" cdlatex-position-cursor nil nil t)
          ("Big\\|" "insert Big \\|" "\\Big\\| ? \\Big\\|" cdlatex-position-cursor nil nil t)
          ("bigg\\|" "insert bigg\\|" "cdlatex-position-cursor" cdlatex-position-cursor nil nil t)
          ("case" "insert cases" "" cdlatex-environment ("cases") nil t)
          ("big\\|" "insert big \\|" "\\big\\| ? \\big\\|" cdlatex-position-cursor nil nil t)
          ("se" "insert \\{\\}" "\\{ ? \\}" cdlatex-position-cursor nil nil t)
          ("big{" "insert big {}" "\\big\\{ ? \\big\\" cdlatex-position-cursor nil nil t)
          ("big[" "insert big []" "\\big[ ? \\big" cdlatex-position-cursor nil nil t)
          ("Big{" "insert Big{}" "\\Big\\{ ? \\Big\\" cdlatex-position-cursor nil nil t)
          ("bigg{" "insert bigg{}" "\\bigg\\{ ? \\bigg\\" cdlatex-position-cursor nil nil t)
          ("Big[" "insert Big[" "\\Big[ ? \\Big" cdlatex-position-cursor nil nil t)
          ("bigg[" "insert bigg[" "\\bigg[ ? \\bigg" cdlatex-position-cursor nil nil t)
          ("pa" "insert pause" "\\pause" ignore nil t nil)
          ("enu*" "insert enu" "\\begin{enumerate}\n\\item ?\n\\end{enumerate}" cdlatex-position-cursor nil t nil)
          ("it" "insert \\item" "\\item?" cdlatex-position-cursor nil t nil)))
#+end_src
**** 环境模板
#+begin_example elisp :tangle ./cdlatex-config.el
(setq cdlatex-env-alist
          '(("equation*" "\\begin{equation*}
  ?
  \\end{equation*}" nil)
            ("cases" "\\begin{cases}
  ? &   \\\\
   &   \\\\
  \\end{cases}" "? &  \\\\")
            ("frame" "\\begin{frame}
  \\frametitle{?}

  \\end{frame}" nil)
            ("inparaitem" "\\begin{inparaitem}
  \\item ?
  \\end{inparaitem}" "\\item ?")
            ("enumerate" "\\begin{enumerate}[?]
  \\item
  \\end{enumerate}" "\\item ?")
            ("inparaenum" "\\begin{inparaenum}
  \\item ?
  \\end{inparaenum}" "\\item ?")
            ("theorem" "\\begin{theorem}
  \\label{thm:?}

  \\end{theorem}" nil)
            ("lemma" "\\begin{lemma}
  \\label{lem:?}

  \\end{lemma}" nil)
            ("proof" "\\begin{proof}?

  \\end{proof}" nil)
            ("definition" "\\begin{definition}
  \\label{def:?}

  \\end{definition}" nil)
            ("proposition" "\\begin{proposition}

  \\end{proposition}" nil)
            ("exercise" "\\begin{exercise}[?]

  \\end{exercise}" nil)))
#+end_example
**** 数学字体修饰设置
#+begin_src elisp :tangle ./cdlatex-config.el
  (setq cdlatex-math-modify-alist
           '((?t "\\mathbb" "" t nil nil)))
#+end_src
**** 数学符号
#+begin_src elisp :tangle ./cdlatex-config.el
  (setq cdlatex-math-symbol-alist
        '((?0 ("\\varnothing" "\\emptyset"))
          (?1 ("\\ONE" "\\one"))
          (?. ("\\cdot" "\\circ"))
          (?v ("\\vee" "\\bigvee"))
          (?& ("\\wedge" "\\bigwedge"))
          (?9 ("\\cap" "\\bigcap"))
          (?+ ("\\cup" "\\bigcup"))
          (?- ("\\rightharpoonup" "\\hookrightarrow" "\\circlearrowleft"))
          (?= ("\\equiv" "\\Leftrightarrow" "\\Longleftrightarrow"))
          (?~ ("\\sim" "\\approx" "\\propto"))
          (?7 ("\\otimes" "\\bigotimes"))
          (?6 ("\\oplus" "\\bigoplus"))
          (?L ("\\Lambda" "\\lim_{?}^{}" "\\lim\\limits_{?}^{}"))
          (?* ("\\times" "\\prod"))
          (?e ("\\eps" "\\epsilon" "\\exp\\Big( ? \\Big)"))
          (?> ("\\mapsto" "\\longrightarrow" "\\rightrightarrows"))
          (?< ("\\preceq" "\\leftarrow" "\\longleftarrow"))
          (?| ("\\parallel" "\\perp"))
          (?S ("\\Sigma" "\\sum_{?}^{}"))
          (?{ ("\\subset" "\\subseteq"))
          (?} ("\\supset" "\\supseteq"))))
#+end_src
*** use-package 代码
#+begin_src elisp
  (use-package cdlatex
    :straight (cdlatex
               :local-repo "../../lisp/" ;; 从 <user-dir>/lisp/ 读入 cdlatex-config.el
               :type nil)
    :defer 6
    :config ;; 导入 cdlatex 自定义设置
    (setq cdlatex-paired-parens "$[{(")
    (load-file (expand-file-name "cdlatex-config.el" user-emacs-directory)))
#+end_src

** LaTeX 编辑
主要使用 AucTeX 及配套插件
*** AucTeX 设置
注意: 本小节代码全部写入 =./auctex-config.el=
**** 环境折叠
#+begin_src elisp :tangle ./auctex-config.el
  (setq TeX-fold-type-list '(env macro comment)
        TeX-fold-env-spec-list '(("[comment]" ("comment")) ("[proof]" ("proof")))
        LaTeX-fold-env-spec-list '(("frame" ("frame")))
        TeX-fold-macro-spec-list
        '(("[f]" ("footnote" "marginpar"))
          ("[c]" ("cite"))
          ("[l]" ("label"))
          ("[r]" ("ref" "pageref" "eqref"))
          ("[i]" ("index" "glossary"))
          ("[1]:||*" ("item"))
          ("..." ("dots"))
          ("(C)" ("copyright"))
          ("(R)" ("textregistered"))
          ("TM" ("texttrademark"))
          (1 ("emph" "textit" "textsl" "textmd" "textrm" "textsf" "texttt" "textbf" "textsc" "textup"))))
#+end_src
**** 数学字体
用 ~C-x C-e <key>~ 改变选中文字的字体.
#+begin_src elisp :tangle ./auctex-config.el
  (setq LaTeX-font-list
        '((?m "\\textmc{" "}" "\\mathmc{" "}")
          (?g "\\textgt{" "}" "\\mathgt{" "}")
          (?e "\\en{" "}")
          (?c "\\cn{" "}")
          (?4 "$" "$")
          (1 "" "" "\\mathcal{" "}")
          (2 "\\textbf{" "}" "\\mathbf{" "}")
          (3 "\\textsc{" "}")
          (5 "\\emph{" "}")
          (6 "\\textsf{" "}" "\\mathsf{" "}")
          (9 "\\textit{" "}" "\\mathit{" "}")
          (12 "\\textulc{" "}")
          (13 "\\textmd{" "}")
          (14 "\\textnormal{" "}" "\\mathnormal{" "}")
          (18 "\\textrm{" "}" "\\mathrm{" "}")
          (19 "\\textsl{" "}" "\\mathbb{" "}")
          (20 "\\texttt{" "}" "\\mathtt{" "}")
          (21 "\\textup{" "}")
          (23 "\\textsw{" "}")
          (4 "" "" t)))
#+end_src
**** preview-latex 设置
- specify what environment should be previewed.
- show correct counters in equation preview
#+begin_src elisp :tangle ./auctex-config.el
   (setq preview-default-option-list
         '("displaymath" "floats" "graphics" "textmath" "footnotes") ;; 执行预览的环境
         preview-preserve-counters t ;; 保留数学公式编号
         preview-pdf-color-adjust-method 'compatible) ;; 预览图片使用Emacs主题背景色
#+end_src
**** reftex
#+begin_src elisp :tangle ./auctex-config.el
  (setq  reftex-label-alist ;; 交叉引用的自定义类型
         '(("theorem" ?t "thm:" nil nil ("Theorem" "定理"))
           ("lemma" ?a "lem:" nil nil ("Lemma")))
         reftex-ref-macro-prompt nil ;; ~cte<tab>~ 后不提示类型
         reftex-ref-style-default-list '("Default")) ;; 默认引用风格
#+end_src
