.emacs.d/init.el

(use-package cdlatex
  :straight (cdlatex
             :local-repo "../../lisp/" ;; 从 <user-dir>/lisp/ 读入 cdlatex-config.el
             :type nil)
  :defer 6
  :config ;; 导入 cdlatex 自定义设置
  (setq cdlatex-paired-parens "$[{(")
  (load-file (expand-file-name "cdlatex-config.el" user-emacs-directory)))
