.emacs.d/emacs-config.org
**** Prettify
查找Unicode编码: [[https://en.wikipedia.org/wiki/Mathematical_operators_and_symbols_in_Unicode]]
#+begin_src elisp :tangle ./auctex-config.el
  (require 'tex-mode) ;; 载入 tex--prettify-symbols-alist 变量
  (defun my/more-prettified-symbols ()
    (mapc (lambda (pair) (delete pair tex--prettify-symbols-alist))
          '(("\\supset" . 8835)))
    (mapc (lambda (pair) (cl-pushnew pair tex--prettify-symbols-alist))
          '(("\\Z" . 8484)
            ("\\Q" . 8474)
            ("\\N" . 8469)
            ("\\R" . 8477)
            ("\\eps" . 949)
            ("\\inf" . #x22C0) 
            ("\\sup". #x22C1)
            ("\\ONE" . #x1D7D9)
            ("\\mathbb{S}" . #x1D54A)
            ("\\PP" . #x2119)
            ("\\Ps" . #x1D5AF )
            ("\\Pp" . #x1D40F)
            ("\\E" . #x1D5A4)
            ("\\Ee" . #x1D404)
            ("\\EE" . #x1D53C )
            ("\\Fc" . #x2131)
            ("\\Nc" . #x1D4A9))))
  (my/more-prettified-symbols) ;; 读入自定义 prettify 符号
#+end_src
*** outline-minor-mode 前缀
#+begin_src elisp
  (setq outline-minor-mode-prefix [(control o)])
#+end_src
*** 窗口管理
=pdf= 文件和 =tex= 文件默认使用一个窗口
#+begin_src elisp
  (add-to-list 'display-buffer-alist '(".*tex.*" (display-buffer-reuse-window)))
  (add-to-list 'display-buffer-alist '(".*pdf.*" (display-buffer-reuse-window)))
#+end_src
*** LaTeX 模式设置
#+begin_src elisp
  (defun my-latex-hook ()
    (turn-on-cdlatex) 
    (turn-on-reftex) 
    (outline-minor-mode) ;; 大纲预览
    (outline-hide-body) ;; 启动时折叠文件
    (prettify-symbols-mode t)) ;; prettify 数学符号
#+end_src
*** pdf-tools设置
#+begin_src elisp
  (use-package pdf-tools
        :straight (:host github :repo "vedang/pdf-tools"
                         :branch "feature/emacs-26.3" ;; 不使用最新版
                         :build (:not native-compile)) ;; 禁用本地化编译
    :mode ("\\.pdf\\'" . pdf-view-mode) ;; pdf 文件默认打开方式
    :bind
    (:map pdf-view-mode-map
     ("d" . pdf-view-next-page-command)
     ("a" . pdf-view-previous-page-command)
     ("s" . pdf-view-scroll-up-or-next-page)
     ("w" . pdf-view-scroll-down-or-previous-page)
     :map pdf-history-minor-mode-map
     ("b" . pdf-history-backward)
     :map pdf-annot-minor-mode-map
     ("C-a a" . pdf-annot-add-highlight-markup-annotation)
     ("C-a s" . pdf-annot-add-squiggly-markup-annotation)
     ("C-a u" . pdf-annot-add-underline-markup-annotation)
     ("C-a d" . pdf-annot-delete))
    :custom
    (pdf-view-midnight-colors '("#000000" . "#9bCD9b")) ;; 夜间模式设置绿色底色
    :config
    (require 'pdf-annot) ;; 设置 pdf-annot-mimor-mode-map 必须
    (require 'pdf-history) ;; 设置 pdf-history-minor-mode-map 必须
    (add-hook 'pdf-view-mode-hook 'pdf-view-fit-width-to-window) ;; 默认适应页宽
    (add-hook 'pdf-view-mode-hook 'pdf-view-midnight-minor-mode) ;; 默认夜间模式
    (pdf-tools-install))
#+end_src
*** use-package代码
#+begin_src elisp
  (use-package tex
    :defer 8
    :straight auctex
    :custom
    (TeX-parse-self t) ;; 自动解析 tex 文件found
    (TeX-PDF-mode t) 
    (TeX-DVI-via-PDFTeX t)
    ;; 正向与反向搜索设置
    (TeX-source-correlate-mode t)
    (TeX-source-correlate-method 'synctex)
    (TeX-view-program-selection '((output-pdf "PDF Tools"))) ;; 使用 pdf-tools 预览 pdf
    (TeX-source-correlate-start-server t)
    :config
    ;; 设置 LaTeX 语法高亮颜色及字体大小
    (require 'font-latex)
    (set-face-attribute 'font-latex-math-face nil :foreground "#f78c6c" :font "Cambria Math" :height 1.15) ;; 数学符号
    (set-face-attribute 'font-latex-script-char-face nil :foreground "#c792ea") ;; 上下标字符^与_
    (set-face-attribute 'font-latex-sedate-face nil :foreground "#ffcb6b" :font "Cambria Math" :height 1.15) ;; 关键字
    (setq-default TeX-master t) ;; 默认主文件询问
    (add-hook 'LaTeX-mode-hook 'my-latex-hook) ;; 加载LaTeX模式设置
    (add-hook 'TeX-after-compilation-finished-functions
              #'TeX-revert-document-buffer) ;; 编译后更新 pdf 文件
    (load-file (expand-file-name "auctex-config.el" user-emacs-directory))) ;; 加载AucTeX变量设置
#+end_src
* Org mode 基本设置
** 项目符号
#+begin_src elisp
  (use-package org-bullets ;; 标题符号
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "✸" "✿" "◉" "○" "✸" "✿")))
#+end_src

列表符号自动显示为 "•"
#+begin_src elisp
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
#+end_src
** 在同一窗口打开 org 文件
#+begin_src elisp
  (defun my/follow-link-at-current-window () 
    (interactive)
    (let ((org-link-frame-setup (quote ((vm . vm-visit-folder-other-frame)
                                        (vm-imap . vm-visit-imap-folder-other-frame)
                                        (gnus . gnus)
                                        (file . find-file)
                                        (wl . wl-other-frame)))))

      (org-open-at-point)))
  (defun my/follow-link-at-current-window-mouse (event)
    (interactive (list last-command-event))
    (posn-set-point (event-end event))
    (let ((org-link-frame-setup (quote ((vm . vm-visit-folder-other-frame)
                                        (vm-imap . vm-visit-imap-folder-other-frame)
                                        (gnus . gnus)
                                        (file . find-file)
                                        (wl . wl-other-frame)))))
      (org-open-at-point)))
#+end_src
** org-cdlatex-mode 中输入成对"$"及括号
#+begin_src elisp
  (defun my/insert-inline-OCDL ()
    (interactive)
    (insert "\\(")
    (save-excursion (insert " \\)" )))
  (defun my/insert-dollar-OCDL ()
    (interactive)
    (insert "$")
    (save-excursion (insert "$" )))
  (defun my/insert-bra-OCDL ()
    (interactive)
    (insert "(")
    (save-excursion (insert ")" )))
  (defun my/insert-sq-bra-OCDL ()
    (interactive)
    (insert "[")
    (save-excursion (insert "]" )))
  (defun my/insert-curly-bra-OCDL ()
    (interactive)
    (insert "{")
    (save-excursion (insert "}" )))
#+end_src
** 自动显示标记
#+begin_src elisp
  (use-package org-appear :hook org-mode)
#+end_src
** org-download 设置
#+begin_src elisp
  (use-package org-download
    :defer t
    :custom
    (org-download-heading-lvl 1) ;; 以一级标题作为图片文件夹
    :after org
    :bind (:map org-mode-map
                ("C-c i y" . org-download-yank)
                ("C-c i d" . org-download-delete)
                ("C-c i e" . org-download-edit))
    :config
    ;; 用文件名作为文件夹
    (defun my-org-download-method (link) 
      (let ((filename
             (file-name-nondirectory
              (car (url-path-and-query
                    (url-generic-parse-url link)))))
            (dirname (concat "./img/" (file-name-sans-extension (file-name-nondirectory (buffer-file-name))))))
        (setq org-download-image-dir dirname)
        (make-directory dirname t)
        (expand-file-name (funcall org-download-file-format-function filename) dirname)))
    (setq org-download-method 'my-org-download-method)
    ;; 在 Windows 系统下修复过时的convert.exe; 注意: 用户名文件夹不能含有空格!
    (defun my/org-download-clipboard ()
      (interactive)
      (let ((filename (expand-file-name "screenshot.png" temporary-file-directory)))
        (shell-command-to-string (format "magick clipboard: %s" filename))
        (when (file-exists-p filename)
          (org-download-image filename)
          (delete-file filename))))
    ;; 绑定剪贴板图片的快捷键
    (if my/is-windows
        (define-key org-mode-map (kbd "C-M-y") #'my/org-download-clipboard)
      (define-key org-mode-map (kbd "C-M-y") #'org-download-clipboard)))
#+end_src
** org-fragtog
自动编译数学公式并智能识别光标位置
#+begin_src elisp
  (use-package org-fragtog
    :hook (org-mode . org-fragtog-mode))
#+end_src

** org模式设置
#+begin_src elisp
  (defun my-org-hook ()
    (org-indent-mode) ;; 自动缩进
    (variable-pitch-mode 1) ;; 可变间距字体
    (org-cdlatex-mode) ;; LaTeX 公式
    (visual-line-mode 1))
#+end_src
** visual-fill-column
#+begin_src elisp
  (defun my/org-mode-visual-fill ()
    (setq visual-fill-column-width 150
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))
  (use-package visual-fill-column
    :hook (org-mode . my/org-mode-visual-fill))
#+end_src
