.emacs.d/init.el
  (org-M-RET-may-split-line nil)
  (org-hide-emphasis-markers t) ;; 默认隐藏标记, 如=,~,*,_ 等; 与 org-appear 配合
  (org-startup-folded 'content) ;; 开启时折叠大纲
  (org-ellipsis " ▾") ;; 用小箭头代替...表示折叠
  (org-format-latex-options
   '(:foreground default :background default :scale 1.8 :html-foreground "Black" :html-background "Transparent" :html-scale 1.5 :matchers ("begin" "$1" "$" "$$" "\\(" "\\["))) ;; 公式预览设置
  ;; 以下为 LaTeX 语法高亮设置
  (org-highlight-latex-and-related '(native latex entities))
  (org-pretty-entities t)
  (org-pretty-entities-include-sub-superscripts nil)

  (org-priority-lowest ?E) ;; org-agenda 的优先级设为A-E
  (org-priority-default ?D) ;; org-agenda 的默认优先级设为D
  (org-structure-template-alist ;; 用 org-tempo 快速插入代码块
   '(("el" . "src elisp")
     ("la" . "src latex")
     ("sh" . "src shell")
     ("a" . "export ascii")
     ("c" . "center")
     ("C" . "comment")
     ("e" . "example")
     ("E" . "export")
     ("h" . "export html")
     ("l" . "export latex")
     ("q" . "quote")
     ("s" . "src")
     ("v" . "verse")))
  :bind
  (:map org-mode-map
        ("C-c o" . my/follow-link-at-current-window) ;; 在当前窗口打开 org 文件
        ("C-<down-mouse-1>" . my/follow-link-at-current-window-mouse) ;; Ctrl+鼠标点击时, 在当前窗口打开 org 文件
        ("C-<drag-mouse-1>" . my/follow-link-at-current-window-mouse)
        :map org-cdlatex-mode-map ;; 实现配对输入$, (, [, { 及 \( 与 \)
        ("$" . my/insert-dollar-OCDL)
        ("C-$" . my/insert-inline-OCDL)
        ("(" . my/insert-bra-OCDL)
        ("[" . my/insert-sq-bra-OCDL)
        ("{" . my/insert-curly-bra-OCDL))
  :config
  (require 'org-tempo) ;; 保证 org-structure-template-alist 可用
  ;; 标题字体大小优化
  (set-face-attribute 'org-document-title nil :weight 'bold :height 1.3)
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :weight 'medium :height (cdr face)))
  ;; org 字体美化
  (require 'org-faces)
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-block-begin-line nil :foreground nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-block-end-line nil :foreground nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-property-value nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil  :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-drawer nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-document-info-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  (setq org-fontify-quote-and-verse-blocks t) ;; 启用 org-qoute 变量为 quote 设置不同的字体
  (set-face-attribute 'org-quote nil :inherit 'fixed-pitch)
  (require 'org-indent)
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))

  (add-hook 'org-mode-hook 'my-org-hook))

(use-package org-present
  :defer t
  :config
  (defun my/org-present-prepare-slide (buffer-name heading)
    (org-overview)  ;; 仅显示顶层标题Show only top-level headlines
    (org-show-entry);; 展开当前标题Unfold the current entry
    (org-show-children))   ;; 显示当前子标题

  (defun my/org-present-start () ;; 开始幻灯片的设置
    (setq visual-fill-column-width 110
      visual-fill-column-center-text t) ;; 调整显示界面
    ;; 调整字体大小
    (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                       (header-line (:height 4.0) variable-pitch)
                                       (org-document-title (:height 1.75) org-document-title)
                                       (org-code (:height 1.55) org-code)
                                       (org-verbatim (:height 1.55) org-verbatim)
                                       (org-block (:height 1.25) org-block)
                                       (org-block-begin-line (:height 0.7) org-block)))
    (setq header-line-format " ") ;; 在标题前加入空行
    (org-display-inline-images) ;; 显示图片
    (flyspell-mode 0) ;; 禁用拼写检查 (防止标红影响效果)
    (read-only-mode 1) ;; 只读模式
    )

  (defun my/org-present-end () ;; 重置上述设置
    (setq-local face-remapping-alist 
                '((default variable-pitch default)))      
    (setq header-line-format nil) 
    (org-remove-inline-images)
    (org-present-small)
    (flyspell-mode t)
    (read-only-mode 0))

  (add-hook 'org-present-mode-hook 'my/org-present-start)
  (add-hook 'org-present-mode-quit-hook 'my/org-present-end)
  (add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide))

(use-package org-noter
  :defer t
  :straight (:host github
                   :repo "org-noter/org-noter"
                   :files ("*.el" "modules/*.el"))
  :bind
  (("C-c n n" . org-noter)
   :map org-noter-doc-mode-map
   ("M-e" . org-noter-insert-precise-note)
   ("e" . org-noter-insert-note))
  :custom
  (org-noter-highlight-selected-text t)
  (org-noter-notes-search-path '("~/repos/notes/ref/"))
  (org-noter-doc-split-fraction '(0.5 . 0.5))
  (org-noter-auto-save-last-location t))

(use-package org-ref
  :defer t
  :bind (:map org-mode-map
              ("C-c (". org-ref-insert-label-link)
              ("C-c )". org-ref-insert-ref-link)))

(setq zot_bib '("~/NutStore/1/NutStore/Zotero-Library/Better BibTeX Export/My Library.bib"
                "~/NutStore/1/NutStore/Zotero-Library/Better BibTeX Export/My Library-desktop.bib") ;; Zotero .bib 文件
      org_notes "~/repos/notes/ref/" ;; org-roam 文献笔记目录
      zot_pdf "~/NutStore/1/NutStore/Zotero-Library") ;; Zotero 同步文件夹
(setq my/daily-note-filename "%<%Y-%m-%d>.org" ;; 日记默认文件名
      my/daily-note-header "#+title: %<%Y-%m-%d %a>\n#+SETUPFILE: ~/repos/notes/latex-preamble.org\n\n[[roam:%<%Y-%B>]]\n\n") ;; 日记文件头

(use-package org-roam
  :defer 12
  :custom
