.emacs.d/emacs-config.org
** use-package block
#+begin_src elisp
  (use-package org-roam
    :defer 12
    :custom
    (org-roam-directory "~/repos/notes/") ;; 默认笔记目录
    (org-roam-completion-everywhere t)
    (org-roam-node-display-template ;; 搜索节点信息显示
     (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    (org-roam-db-gc-threshold most-positive-fixnum)
    (org-roam-dailies-directory "daily/") ;; 默认日记目录
    (org-roam-dailies-capture-templates ;; 日记默认模板
     `(("d" "default" entry "* %?" ;; 普通条目
        :target (file+head ,my/daily-note-filename
                           ,my/daily-note-header))
       ("t" "task" entry "* TODO %?\n  %U\n  %a\n  %i" ;; 待办
        :if-new (file+head+olp ,my/daily-note-filename
                               ,my/daily-note-header
                               ("Tasks"))
        :empty-lines 1) 
       ("j" "journal" entry "* %<%I:%M %p> - Journal  :journal:\n\n%?\n\n" ;; 研究日志
        :if-new (file+head+olp ,my/daily-note-filename
                               ,my/daily-note-header
                               ("Log")))
       ("m" "meeting" entry "* %<%I:%M %p> - Meeting with %^{whom}  :meetings:\n\n%?\n\n" 
        :if-new (file+head+olp ,my/daily-note-filename
                               ,my/daily-note-header
                               ("Meeting")))))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n c" . org-roam-capture)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n I" . org-roam-node-insert-immediate)
           ("C-c n t" . my/org-roam-capture-task)
           ("C-c n k" . orb-insert-link)
           ("C-c n a" . orb-note-actions)
           ("C-c n d" . my/org-roam-jump-menu/body)
           ("C-c n P" . my/org-roam-insert-new-project)
           ("C-c n p" . my/org-roam-find-project)
           ("C-c n u" . org-roam-ui-mode)
           ("C-c n j" . org-roam-dailies-capture-today)
           :map org-mode-map
           ("C-M-i" . completion-at-point))
    :config
    (define-key org-roam-mode-map [mouse-1] (kbd "C-u <return>")) ;; org-roam-buffer 界面左键相当于C-u <return>
    (setq org-roam-capture-templates  ;; org-roam 笔记模板
          '(("d" "default" plain "- tag :: \n %?" ;; 普及模板
             :target
             (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title} \n#+SETUPFILE: ./latex-preamble.org")
             :unnarrowed t)
            ("r" "bibliography reference in pdfs" plain ;; 文献模板
             "#+FILETAGS: reading research \n - tags :: %^{keywords} \n* %^{title}
  :PROPERTIES:\n:Custom_ID: %^{citekey}\n:URL: %^{url}\n:AUTHOR: %^{author-or-editor}\n:NOTER_DOCUMENT: ~/Nutstore/1/Nutstore/Zotero-Library/%^{citekey}.pdf\n:NOTER_PAGE:\n:END:"      
             :target
             (file+head "ref/${citekey}.org" "#+title: ${title}\n#+SETUPFILE: ../latex-preamble.org\n"))
            ("a" "article/post/blog/discussion" plain ;; 其它阅读模板
             "#+FILETAGS: reading \n- tags :: \n- sources ::\n"      
             :target
             (file+head "article/%<%Y%m%d%H%M%S>-reading-${slug}.org" "#+title: ${title}\n#+SETUPFILE: ../latex-preamble.org\n"))
            ("s" "Seminar notes" plain "#+FILETAGS: seminar\n- title:\n- speaker:\n- event:\n- tags ::" ;; 学术报告模板
             :target
             (file+head "seminar/%<%Y%m%d>-seminar-${slug}.org" "#+title: ${title}\n#+SETUPFILE: ../latex-preamble.org\n#+filetags: seminar"))))
    (require 'org-roam-dailies) 
    (org-roam-db-autosync-mode) ;; 自动同步数据库
    (my/org-roam-refresh-agenda-list) ;; 自动收集 project 文件中的待办事项
    (add-to-list 'org-after-todo-state-change-hook ;; 将完成的待办事项备份至日记
                 (lambda ()
                   (when (equal org-state "DONE")
                     (my/org-roam-copy-todo-to-today)))))
#+end_src
** Org-roam-ui
org-roam-ui 可以显示节点连接图
#+begin_src elisp
    (use-package org-roam-ui
      :straight
      (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
      :defer t
      :after org-roam
      :custom
      (org-roam-ui-sync-theme t)
      (org-roam-ui-follow t)
      (org-roam-ui-update-on-save t)
      (org-roam-ui-open-on-start t))
#+end_src
** 文献笔记设置
导入 Zotero 中文献库, 并将文献笔记作为笔记节点
*** helm-bibtex
#+begin_src elisp
  (use-package helm-bibtex
    :defer t
    :custom
    (bibtex-completion-notes-path org_notes)
    (bibtex-completion-bibliography zot_bib)
    (bibtex-completion-library-path zot_pdf))
#+end_src
*** org-roam-bibtex
#+begin_src elisp
  (use-package org-roam-bibtex
    :after org-roam
    :hook (org-roam-mode . org-roam-bibtex-mode)
    :custom
    (orb-insert-interface 'helm-bibtex)
    (orb-insert-link-description 'citekey)
    (orb-preformat-keywords
     '("citekey" "title" "url" "author-or-editor" "keywords" "file"))
    (orb-process-file-keyword t)
    (orb-attached-file-extensions '("pdf")))
#+end_src
** org-roam buffer 设置
#+begin_src elisp
  (add-to-list 'display-buffer-alist
               '("\\*org-roam\\*"
                 (display-buffer-in-direction)
                 (direction . right)
                 (window-width . 0.33)
                 (window-height . fit-window-to-buffer)))
  (add-hook 'org-roam-mode-hook 'visual-line-mode) ;; 自动换行
#+end_src
** 项目与待办管理
实现功能:
- 定义一类特殊笔记类型: project
- 新增/查找项目的函数
- 在项目中插入待办并由 org-agenda 收集
*** 基本函数与变量  
#+begin_src elisp
  (defvar my/org-roam-project-template ;; 项目笔记模板
    '("p" "project" plain "** TODO %?"
      :if-new (file+head+olp "%<%Y%m%d%H>-${slug}.org"
                             "#+title: ${title}\n#+category: ${title}\n#+filetags: Project\n"
                             ("Tasks"))))
  (defun my/org-roam-filter-by-tag (tag-name) ;; 按 tag 搜索笔记; 需要 lexical binding
    (lambda (node)
      (member tag-name (org-roam-node-tags node)))) 
  (defun my/org-roam-list-notes-by-tag (tag-name) ;; 按 tag 显示笔记
    (mapcar #'org-roam-node-file
            (seq-filter
             (my/org-roam-filter-by-tag tag-name)
             (org-roam-node-list))))

#+end_src
*** 新增/查找项目
#+begin_src elisp
    (defun my/org-roam-project-finalize-hook ()
    "Adds the captured project file to `org-agenda-files' if the
    capture was not aborted."
    ;; Remove the hook since it was added temporarily
    (remove-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; Add project file to the agenda list if the capture was confirmed
    (unless org-note-abort
      (with-current-buffer (org-capture-get :buffer)
        (add-to-list 'org-agenda-files (buffer-file-name)))))

  (defun my/org-roam-insert-new-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; Select a project file to open, creating it if necessary
    (org-roam-capture- :node (org-roam-node-read
                              nil
                              (my/org-roam-filter-by-tag "Project"))
                       :templates (list my/org-roam-project-template)))

  (defun my/org-roam-find-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; Select a project file to open, creating it if necessary
    (org-roam-node-find
     nil
     nil
     (my/org-roam-filter-by-tag "Project")))
#+end_src
把项目笔记加入 org-agenda 文件中
#+begin_src elisp
  (defun my/org-roam-refresh-agenda-list ()
    (interactive)
    (setq org-agenda-files (my/org-roam-list-notes-by-tag "Project")))
#+end_src
*** 新增项目中的待办
#+begin_src elisp
    (defun my/org-roam-capture-task ()
    (interactive)
    ;; 新增项目后, 更新 org-agende 文件列表
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; 新增待办
    (org-roam-capture- :node (org-roam-node-read
                              nil
                              (my/org-roam-filter-by-tag "Project"))
                       :templates (list my/org-roam-project-template)))
#+end_src
