.emacs.d/emacs-config.org
*** 日记
月结/年终总结模板
  #+begin_src elisp
    (defun my/org-roam-goto-month ()
      (interactive)
      (org-roam-capture- :goto (when (org-roam-node-from-title-or-alias (format-time-string "%Y-%B")) '(4))
                         :node (org-roam-node-create)
                         :templates '(("m" "month" plain "\n* Goals\n\n%?* Summary\n\n"
                                       :if-new (file+head "%<%Y-%B>.org"
                                                          "#+title: %<%Y-%B>\n#+filetags: Project\n")
                                       :unnarrowed t))))

    (defun my/org-roam-goto-year ()
      (interactive)
      (org-roam-capture- :goto (when (org-roam-node-from-title-or-alias (format-time-string "%Y")) '(4))
                         :node (org-roam-node-create)
                         :templates '(("y" "year" plain "\n* Goals\n\n%?* Summary\n\n"
                                       :if-new (file+head "%<%Y>.org"
                                                          "#+title: %<%Y>\n#+filetags: Project\n")
                                       :unnarrowed t))))
  #+end_src
Hydra 定义的日记界面
  #+begin_src elisp
    (defhydra my/org-roam-jump-menu (:hint nil)
      "
    ^Dailies^        ^Capture^       ^Jump^
    ^^^^^^^^-------------------------------------------------
    _t_: today       _T_: today       _m_: current month
    _r_: tomorrow    _R_: tomorrow    _e_: current year
    _y_: yesterday   _Y_: yesterday   ^ ^
    _d_: date        ^ ^              ^ ^
    "
      ("t" org-roam-dailies-goto-today)
      ("r" org-roam-dailies-goto-tomorrow)
      ("y" org-roam-dailies-goto-yesterday)
      ("d" org-roam-dailies-goto-date)
      ("T" org-roam-dailies-capture-today)
      ("R" org-roam-dailies-capture-tomorrow)
      ("Y" org-roam-dailies-capture-yesterday)
      ("m" my/org-roam-goto-month)
      ("e" my/org-roam-goto-year)
      ("c" nil "cancel"))
  #+end_src

*** 在日记中备份已完成待办
#+begin_src elisp
  (defun my/org-roam-copy-todo-to-today ()
    (interactive)
    (let ((org-refile-keep t) ;; Set this to nil to delete the original!
          (org-roam-dailies-capture-templates
            '(("t" "tasks" entry "%?"
               :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n" ("Tasks")))))
          (org-after-refile-insert-hook #'save-buffer)
          today-file
          pos)
      (save-window-excursion
        (org-roam-dailies--capture (current-time) t)
        (setq today-file (buffer-file-name))
        (setq pos (point)))
      ;; Only refile if the target file is different than the current file
      (unless (equal (file-truename today-file)
                     (file-truename (buffer-file-name)))
        (org-refile nil nil (list "Tasks" today-file nil pos)))))
#+end_src
** 即时加入空笔记的函数
#+begin_src elisp
(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (push arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))
#+end_src
* 项目管理
** Magit
#+begin_src elisp
  (use-package magit
    :commands magit-status
    :autoload  magit-get-current-branch
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src
** Perspective 
#+begin_src elisp
  (use-package perspective
    :defer 2
    :bind (("C-M-k" . persp-switch)
           ("C-M-n" . persp-next)
           ("C-x k" . persp-kill-buffer*))
    :custom
    (persp-mode-prefix-key (kbd "C-x x"))
    :config
    (unless (equal persp-mode t)
      (persp-mode))
    (setq persp-state-default-file (expand-file-name ".persp-save" user-emacs-directory)))
#+end_src
* 语法检查
** flyspell
需要安装 =aspell= 或 =hunspell=. =Windows= 可通过 =msys2= 安装 =libenchant= 及相关字典
#+begin_src elisp
        (use-package flyspell
          :defer t
          :straight (:local-repo "../../lisp/" :type nil)
          :hook (org-mode LaTeX-mode) 
          :config
          (setq ispell-personal-dictionary (expand-file-name ".ispell" user-emacs-directory))) ;; 默认个人字典
#+end_src
* 编程
** 终端
#+begin_src elisp
  (use-package shell
    :defer t
    :config 
    (setq explicit-shell-file-name "powershell.exe")
    (setq explicit-powershell.exe-args '()))
#+end_src
** 字幕编辑
#+begin_src elisp
  (use-package subed
    :straight
    (:host github :repo "sachac/subed" :files ("subed/*.el"))
    :config
    ;; Remember cursor position between sessions
    (add-hook 'subed-mode-hook 'save-place-local-mode)
    ;; Break lines automatically while typing
    (add-hook 'subed-mode-hook 'turn-on-auto-fill)
    ;; Break lines at 40 characters
    (add-hook 'subed-mode-hook (lambda () (setq-local fill-column 40)))
    ;; Some reasonable defaults
    (add-hook 'subed-mode-hook 'subed-enable-pause-while-typing)
    ;; As the player moves, update the point to show the current subtitle
    (add-hook 'subed-mode-hook 'subed-enable-sync-point-to-player)
    ;; As your point moves in Emacs, update the player to start at the current subtitle
    (add-hook 'subed-mode-hook 'subed-enable-sync-player-to-point)
    ;; Replay subtitles as you adjust their start or stop time with M-[, M-], M-{, or M-}
    (add-hook 'subed-mode-hook 'subed-enable-replay-adjusted-subtitle)
    ;; Loop over subtitles
    (add-hook 'subed-mode-hook 'subed-enable-loop-over-current-subtitle)
    ;; Show characters per second
    (add-hook 'subed-mode-hook 'subed-enable-show-cps))
#+end_src

#+RESULTS:
: t

** python
#+begin_src elisp
  (use-package python-mode
      :defer t)
#+end_src
*** cython
#+begin_src elisp
  (use-package cython-mode
      :mode "\\.pyx\\'"
      :config
      (add-hook 'cython-mode-hook #'flycheck-mode))
#+end_src
*** elpy
follow suggestion from https://emacs.stackexchange.com/questions/10065/how-can-i-defer-loading-elpy-using-use-package to defer elpy mode
#+begin_src elisp
  (use-package elpy
      :defer t
      :config
      (advice-add 'python-mode :before 'elpy-enable)
      (setq elpy-modules
            '(elpy-module-company elpy-module-eldoc elpy-module-flymake elpy-module-pyvenv elpy-module-highlight-indentation elpy-module-yasnippet elpy-module-django elpy-module-sane-defaults)))
#+end_src
** markdown
#+begin_src elisp
  (use-package markdown-mode
      :mode "\\.md\\'"
      :custom
      (markdown-command "pandoc -F pandoc-crossref -F pandoc-citeproc -f markdown -t html -s --mathjax")
      :config
      (add-to-list 'process-coding-system-alist '("pandoc" utf-8-dos . utf-8-dos))
      (add-hook 'markdown-mode-hook 'turn-on-cdlatex)
      (markdown-enable-math t))
#+end_src
** yaml
#+begin_src elisp
  (use-package yaml-mode
    :mode "\\.yml\\'")
#+end_src
* 启动时间优化
** esup
#+begin_src elisp
  (use-package esup
    :defer t
    :config
    (setq esup-depth 0))
#+end_src
** 显示启动时间
#+begin_src elisp
  (defun efs/display-startup-time ()
      (message "Emacs loaded in %s with %d garbage collections."
               (format "%.2f seconds"
                       (float-time
                       (time-subtract after-init-time before-init-time)))
               gcs-done))
    (add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+end_src
* 浏览器
** eww 界面优化
#+begin_src elisp
  (use-package shrface
    :defer t
    :after eww
    :config
    (shrface-basic)
    (shrface-trial)
    (shrface-default-keybindings) ; setup default keybindings
    (setq shrface-href-versatile t))
#+end_src
** 代码块
#+begin_src elisp
(use-package shr-tag-pre-highlight
  :after shr
  :config
  (add-to-list 'shr-external-rendering-functions
               '(pre . shr-tag-pre-highlight)))
#+end_src
** EWW 设置
#+begin_src elisp
  (use-package eww
    :defer t
    :custom
    (eww-retrieve-command nil)
    (eww-search-prefix "https://google.com/search?q=")
    (shr-use-fonts nil)
    :init
    (add-hook 'eww-after-render-hook #'shrface-mode)
    :config
    (add-hook 'eww-mode-hook 'visual-line-mode)
    (require 'shrface))
#+end_src
* 结束代码
#+begin_src elisp
  (setq initial-frame-alist '((fullscreen . maximized))) ;; 全屏
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory)) ;; 禁用Emacs写入自定义变量
  (setq gc-cons-threshold (* 2 1000 1000))
#+end_src





